{
  "nav": {
    "navigation": "navigation",
    "socials": "réseaux",
    "home": "accueil",
    "projects": "projets",
    "formula1": "formule 1",
    "contact": "contact"
  },

    "navbar": {
      "welcome": "Accueil",
      "about": "À propos",
      "interests": "Intérêts",
      "stack": "Stack Tech",
      "featured": "Projets en vedette",
      "others": "Autres projets"
    },
    "welcome": {
      "title": "Bienvenue",
      "subtitle": "Salut, je suis Brandon — un étudiant polono-canadien passionné par la technologie, les voyages et l'apprentissage.\nJ'aime créer des technologies à la fois physiques et numériques."
    },
    "about": {
      "title": "À propos de moi",
      "description": "Je suis étudiant en deuxième année de Baccalauréat en Informatique Appliquée (BCS) à l'Université Dalhousie à Halifax, Nouvelle-Écosse.\n\nMes principaux centres d'intérêt sont le développement web/logiciel et la cybercriminalité, en particulier la manière dont les systèmes modernes évoluent, échouent et sont sécurisés.\nJ'aime travailler sur des projets qui m'obligent à penser au-delà du cursus et à prendre en compte les contraintes du monde réel."
    },
    "academics": {
      "title": "Vie académique",
      "university": {
        "label": "Mon université",
        "description": "L'Université Dalhousie me fournit une solide base en informatique, allant des algorithmes et structures de données aux sujets modernes comme le machine learning.\n\nEn dehors des cours, je me concentre sur l'application de ces concepts à travers des projets indépendants et l'expérimentation avec des systèmes et outils réels."
      }
    },
    "interests": {
      "title": "Mes intérêts",
      "technology": {
        "label": "Technologie",
        "description": "J'aime explorer le développement logiciel par le biais de projets pratiques, apprendre de nouveaux outils au fur et à mesure et améliorer ma façon de résoudre les problèmes. Je m'intéresse particulièrement aux systèmes qui fonctionnent de manière continue et à grande échelle."
      },
      "travelling": {
        "label": "Voyages",
        "description": "Voyager me donne une perspective en dehors du code. Prague est ma ville préférée — le mélange d'histoire, d'architecture et de vie quotidienne vous fait sentir comme dans un conte de fées."
      }
    },
    "techStack": {
      "title": "Mon Stack Tech",
      "languages": "Java, Python, JavaScript, C",
      "frontend": "React, HTML, CSS — axé sur les mises en page responsives et l'UI propre",
      "backend": "Node.js, REST APIs, applications de bureau JavaFX",
      "cloud": "Serveurs Linux, Oracle Cloud Infrastructure (VMs), déploiement et surveillance",
      "tools": "Git/GitHub, VS Code, IntelliJ, ligne de commande, développement itératif"
    },
    "closing": {
      "title": "Perspectives",
      "description": "À l'avenir, je souhaite continuer à créer des logiciels significatifs, acquérir de l'expérience dans des environnements professionnels et approfondir ma compréhension de la manière dont la technologie peut être utilisée de manière responsable.\n\nJe suis toujours ouvert à apprendre de nouvelles personnes, de nouveaux systèmes et de nouveaux défis."
    },

    "contact": {
      "title": "Contact",
      "subtitle": "Je serais ravi de vous connecter ! Que ce soit pour parler de technologie, de voyage ou de collaborations potentielles, n’hésitez pas à me contacter.",
      "socials": {
        "title": "Réseaux sociaux",
        "description1": "Mes profils sociaux sont liés dans la barre de navigation à gauche ←. Suivez-moi ou envoyez-moi un message là-bas — je suis actif sur des plateformes comme GitHub, LinkedIn et Twitter, et j’aime partager des idées et des projets.",
        "description2": "Que vous soyez curieux de mon travail, de collaborations ou que vous vouliez juste dire bonjour, n’hésitez pas à me contacter ! La flèche vous guide directement vers mes réseaux sociaux."
      },
      "email": {
        "title": "E-Mail",
        "description1": "Vous pouvez également me contacter par e-mail à bkuciapski1@gmail.com (personnel) ou bkuciapski@dal.ca (université).",
        "description2": "Je consulte régulièrement mes e-mails, donc n’hésitez pas à envoyer un message si vous avez des questions, des idées de projets ou simplement pour discuter. Je répondrai dès que possible !"
      },
      "connect": {
        "title": "Restons en contact",
        "description1": "Le networking et la collaboration sont parmi mes aspects préférés de la tech et de l’apprentissage. Que ce soit pour discuter d’un défi de programmation, je suis toujours heureux de discuter.",
        "description2": "Si vous le souhaitez, vous pouvez également m’envoyer un message sur les réseaux sociaux, ou simplement mettre cette page en favori et me contacter à tout moment. La barre de navigation à gauche est votre passerelle pour rester en contact !"
      },
      "footer": "© 2026 Brandon Kuciapski. huzarzycom"
    },

    "projects": {
    "featuredTitle": "Travaux en vedette",
    "otherTitle": "Autres projets",

    "huzarzy": {
      "title": "huzarzy.com — Site personnel",
      "description": "Conception et développement d’un site web personnel responsive pour présenter mes projets, mon expérience et mes intérêts, avec des composants React réutilisables, des animations basées sur le défilement et un thème clair/sombre. Accent mis sur la maintenabilité, la performance et une structure UI propre.",
      "tech": "Technos : React, API, JavaScript, CSS, Design responsive"
    },

    "atmocan": {
      "title": "AtmoCan — Application météo JavaFX",
      "description": "Développement d’une application de bureau JavaFX affichant les prévisions météorologiques horaires et quotidiennes au Canada à l’aide d’API externes. Accent mis sur la mise en page UI, le traitement des données et les mises à jour asynchrones.",
      "tech": "Technos : Java, Maven, JavaFX, API REST, JSON"
    },

    "f1": {
      "title": "Classement Formula 1 en direct",
      "description": "Développement d’une application web affichant les classements et données de course de Formula 1 en temps réel via des API tierces. Interface réactive, mises à jour dynamiques et hébergement sur une VM Oracle Cloud, intégrée à huzarzy.com."
    },

    "blockchain": {
      "title": "CHINTCOIN - Client Blockchain",
      "description": "Création d’un client blockchain GUI en JFrame permettant aux utilisateurs de miner, envoyer et recevoir une cryptomonnaie personnalisée nommée CHINTCOIN. Implémentation des concepts de base de la blockchain tels que le minage Proof-of-Work, la validation des transactions et la gestion du registre décentralisé pour explorer les systèmes distribués et les principes cryptographiques. Tout cela développé en Java."
    },

    "filechain": {
      "title": "FileChain — Système personnel de partage de fichiers",
      "description": "Création d’un système léger de partage de fichiers permettant des transferts sécurisés entre mon PC et mon ordinateur portable. Développé en Python avec Tkinter, hébergé sur un Raspberry Pi."
    },

    "sticknotez": {
      "title": "StickNotez — Utilitaire Windows en arrière-plan",
      "description": "Développement d’une application de notes adhésives en C# WinForms fonctionnant en arrière-plan sous Windows, avec stockage persistant et faible consommation de ressources."
    },
    "closing": {
      "title": "Ma façon de concevoir",
      "description": "Je privilégie la clarté, la maintenabilité et la compréhension du fonctionnement interne des systèmes. Je m’intéresse particulièrement aux projets confrontés à des contraintes réelles telles que le réseau, la sécurité, les flux de données et l’expérience utilisateur."
    }
  }
}
