{
  "nav": {
    "navigation": "nawigacja",
    "socials": "społeczności",
    "home": "strona główna",
    "projects": "projekty",
    "formula1": "formuła 1",
    "contact": "kontakt"
  },

    "navbar": {
      "welcome": "Witaj",
      "about": "O mnie",
      "interests": "Zainteresowania",
      "stack": "Tech Stack",
      "featured": "Wyróżniony",
      "others": "Inni"
    },
    "welcome": {
      "title": "Witaj",
      "subtitle": "Cześć, jestem Brandon — polsko-kanadyjski student z pasją do technologii, podróży i nauki.\nLubię tworzyć zarówno technologie fizyczne, jak i cyfrowe."
    },
    "about": {
      "title": "O mnie",
      "description": "Jestem studentem drugiego roku studiów licencjackich z Informatyki Stosowanej (BCS) na Uniwersytecie Dalhousie w Halifax, Nowa Szkocja.\n\nMoje główne zainteresowania to rozwój stron internetowych/oprogramowania i cyberprzestępczość, zwłaszcza jak nowoczesne systemy skalują się, zawiodą i są zabezpieczone.\nLubię pracować nad projektami, które zmuszają mnie do myślenia poza programem nauczania i uwzględniają realne ograniczenia."
    },
    "academics": {
      "title": "Życie akademickie",
      "university": {
        "label": "Mój Uniwersytet",
        "description": "Uniwersytet Dalhousie zapewnia mi solidne podstawy w informatyce, od algorytmów i struktur danych po nowoczesne tematy, takie jak uczenie maszynowe.\n\nPoza wykładami koncentruję się na stosowaniu tych koncepcji w niezależnych projektach i eksperymentowaniu z rzeczywistymi systemami i narzędziami."
      }
    },
    "interests": {
      "title": "Moje zainteresowania",
      "technology": {
        "label": "Technologia",
        "description": "Lubię odkrywać rozwój oprogramowania poprzez praktyczne projekty, uczyć się nowych narzędzi w trakcie pracy i udoskonalać sposób rozwiązywania problemów. Szczególnie interesują mnie systemy działające nieprzerwanie i na dużą skalę."
      },
      "travelling": {
        "label": "Podróże",
        "description": "Podróże dają mi perspektywę poza kodem. Praga jest moim ulubionym miastem — połączenie historii, architektury i codziennego życia sprawia, że czujesz się jak w bajce."
      }
    },
    "techStack": {
      "title": "Mój Tech Stack",
      "languages": "Java, Python, JavaScript, C",
      "frontend": "React, HTML, CSS — skoncentrowane na responsywnych układach i czystym UI",
      "backend": "Node.js, REST API, aplikacje desktopowe JavaFX",
      "cloud": "Serwery Linux, Oracle Cloud Infrastructure (VM), wdrażanie i monitorowanie",
      "tools": "Git/GitHub, VS Code, IntelliJ, linia poleceń, rozwój iteracyjny"
    },
    "closing": {
      "title": "Patrząc w przyszłość",
      "description": "W przyszłości chcę nadal tworzyć wartościowe oprogramowanie, zdobywać doświadczenie w środowiskach profesjonalnych i pogłębiać swoją wiedzę na temat odpowiedzialnego wykorzystania technologii.\n\nJestem zawsze otwarty na naukę od nowych ludzi, systemów i wyzwań."
    },

    "contact": {
      "title": "Kontakt",
      "subtitle": "Chętnie nawiążę kontakt! Niezależnie od tego, czy chcesz porozmawiać o technologii, podróżach czy potencjalnej współpracy, śmiało pisz do mnie.",
      "socials": {
        "title": "Social Media",
        "description1": "Moje profile społecznościowe są połączone w lewym pasku nawigacyjnym ←. Śledź mnie lub napisz wiadomość — jestem aktywny na platformach takich jak GitHub, LinkedIn i Twitter i lubię dzielić się pomysłami oraz projektami.",
        "description2": "Niezależnie od tego, czy jesteś ciekawy mojej pracy, współpracy, czy chcesz tylko powiedzieć cześć, śmiało nawiąż kontakt! Strzałka wskazuje bezpośrednio na moje social media."
      },
      "email": {
        "title": "E-Mail",
        "description1": "Możesz również skontaktować się ze mną mailowo: bkuciapski1@gmail.com (prywatny) lub bkuciapski@dal.ca (szkoła).",
        "description2": "Regularnie sprawdzam e-maile, więc nie wahaj się wysłać wiadomości, jeśli masz pytania, pomysły na projekty lub chcesz się skontaktować. Odpowiem jak najszybciej!"
      },
      "connect": {
        "title": "Pozostańmy w kontakcie",
        "description1": "Networking i współpraca to jedne z moich ulubionych aspektów technologii i nauki. Chętnie porozmawiam o wyzwaniu programistycznym lub projekcie.",
        "description2": "Jeśli chcesz, możesz także wysłać mi wiadomość w mediach społecznościowych lub po prostu dodać tę stronę do zakładek i skontaktować się w dowolnym momencie. Lewy pasek nawigacyjny to Twoja brama do pozostania w kontakcie!"
      },
      "footer": "© 2026 Brandon Kuciapski. huzarzycom"
    },

    "projects": {
    "featuredTitle": "Wybrane projekty",
    "otherTitle": "Pozostałe projekty",

    "huzarzy": {
      "title": "huzarzy.com — Strona osobista",
      "description": "Zaprojektowałem i stworzyłem responsywną stronę internetową prezentującą projekty, doświadczenie i zainteresowania, wykorzystując komponenty React, animacje oparte na przewijaniu oraz tryb jasny i ciemny. Nacisk na czytelną strukturę, wydajność i łatwą utrzymalność.",
      "tech": "Technologie: React, API, JavaScript, CSS, Responsive Design"
    },

    "atmocan": {
      "title": "AtmoCan — Aplikacja pogodowa JavaFX",
      "description": "Stworzyłem aplikację desktopową JavaFX wyświetlającą godzinowe i dzienne prognozy pogody dla Kanady przy użyciu zewnętrznych API. Skupienie na czytelnym interfejsie, przetwarzaniu danych i aktualizacjach asynchronicznych.",
      "tech": "Technologie: Java, Maven, JavaFX, REST API, JSON"
    },

    "f1": {
      "title": "Tabela wyników Formula 1 na żywo",
      "description": "Aplikacja webowa prezentująca na żywo klasyfikację i dane wyścigowe Formuły 1 poprzez integrację z zewnętrznymi API. Dynamiczne aktualizacje, responsywny interfejs oraz hosting na Oracle Cloud VM."
    },

    "blockchain": {
      "title": "CHINTCOIN - Klient Blockchain",
      "description": "Stworzyłem klienta blockchain GUI w JFrame umożliwiającego użytkownikom wydobywanie, wysyłanie i odbieranie niestandardowej kryptowaluty o nazwie CHINTCOIN. Zaimplementowałem podstawowe koncepcje blockchaina, takie jak wydobywanie Proof-of-Work, walidacja transakcji oraz zarządzanie zdecentralizowanym rejestrem, aby eksplorować systemy rozproszone i zasady kryptografii. Wszystko stworzone w języku Java."
    },

    "filechain": {
      "title": "FileChain — Prywatny system udostępniania plików",
      "description": "Lekki system do bezpiecznego przesyłania plików pomiędzy komputerami, zbudowany w Pythonie z użyciem Tkintera i hostowany na Raspberry Pi."
    },

    "sticknotez": {
      "title": "StickNotez — Narzędzie działające w tle systemu Windows",
      "description": "Aplikacja typu sticky notes napisana w C# WinForms, działająca w tle systemu Windows, z trwałym zapisem notatek i niskim zużyciem zasobów."
    },
    "closing": {
      "title": "Jak tworzę",
      "description": "Stawiam na przejrzystość, łatwość utrzymania oraz zrozumienie działania systemów „od środka”. Najbardziej interesują mnie projekty, które uwzględniają realne ograniczenia — sieci, bezpieczeństwo, przepływ danych i doświadczenie użytkownika."
    }
  }
}
